1. 프로그래밍 언어란?
* 종 류
- C/C++, Java, C#
   - 코드 => '컴파일러'(기계어로 변환) => 실행파일 => CPU, 메모리로 실행결과 내기

- Python, JavaScript
   - 코드 => '인터프리터' => CPU, 메모리로 실행결과 내기
   - 인터프리터를 사용함으로써 실행 파일 안만들고 바로 바로 한줄마다 CPU로 돌림!
   - 대신 컴파일러 쓰는 언어에 비해 느리다.


* 이식성(Portability)
- 이식성이 없는 언어
   - 플랫폼마다 '컴파일러'가 추가적으로 더 필요하다.
      - ex) 윈도우용 컴파일러, 리눅스용 컴파일러, 윈도우용 실행파일, 리눅스용 실행파일

- 이식성이 있는 언어
   - ex) Java
   - 컴파일러는 1개만 있으면 어느 플랫폼에서든 쓸 수 있음.
   - 컴파일러가 바이트코드를 생성
   - 플랫폼마다 가상 기계가 있어야 한다.
      - 윈도우 가상기계, 리눅스 가상기계
      - 각 가상 기계가 이 바이트 코드를 돌려 실행 결과를 만들어낸다.

=========================================================================

2. 프로그래밍 언어란?
C/C++의 철학
- C++은 C에서 객체지향 개념이 추가된 것!
- 프로그램의 '자율성'이 높다.
- 실제 세계에서 쓸모가 있어야 한다. ('객체')
- 프로그래머가 스스로 스타일을 선택할 수 있어야 한다.
- 유용한 기능을 추가하는 것이 오용보다 중요하다.
- 프로그래머의 의도를 알 수 없다면 스스로 명시하게 한다.
- C++아래로 다른 언어는 없다. (어셈블리어는 예외)

=========================================================================

3. 코딩하다가 막혔을 때 대처
- 몰라도 계속 보고보고 또 보자! 해결하든 안하든 지속적인 고민은 내 실력을 기하급수적으로 발전하는데 도움을 준다.
- 혼자서 해결해보려고 노력한다.
- 구선생의 도움도 좋다. Document나 Blog활용! 되도록 영문으로 검색해서 보려하면 더더 좋음!